app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "WP_20170415_011.jpg"], ["image_file_size", 508193], ["image_updated_at", "2020-06-06 10:26:04.311109"], ["updated_at", "2020-06-06 10:26:04.320621"], ["id", 1]]
---
def update
    @article = Article.find(params[:id])
    @article.update(article_params)