app/controllers/comments_controller.rb

def create
  @comment = Comment.new(comment_params)
  @comment.article_id = params[:article_id]
  @comments = Comment.all
  @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "abdel"], ["body", "razak"], ["article_id", 18], ["created_at", "2020-06-09 07:58:02.721570"], ["updated_at", "2020-06-09 07:58:02.721570"]]